selenium-or-capybara/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-04-26 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using Selenium with Cucumber through Webrat or Capybara. Which one to choose?</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../pdn.css" type="text/css"/>
<link rel='stylesheet' href='https://use.fontawesome.com/releases/v5.8.2/css/all.css' integrity='sha384-oS3vJWv+0UjzBfQzYUhtDYW+Pj2yciDJxpsK1OYPAYjqT085Qq/1cq5FLXAZQ7Ay' crossorigin='anonymous'>
</head>
<body>
<div id="preamble" class="status">
<div class='cover'>
<div class='cover-card'>
<div class='author-name'>Boško Ivanišević</div>
<div class='author-job'>Developer, Theoretical Physicist</div>
<div class='author-bio mbm'>Ruby, JavaScript, Elixir, C++ and few more</div>
<nav id='sidenav' clas='nav'>
<ul class='nav-list'>
<li class='nav-item'><a href='../index.html'>Home</a1> <span>/</span></li>
<li class='nav-item'><a href='../about.html'>About</a> <span>/</span></li>
</ul>
</nav>
<div class='social-links'>
<ul>
<li><a href='https://ruby.social/@bosko' class='social-link-item' target='_blank' rel='me'>
<i class='fab fa-mastodon'></i>
</a></li>
<li><a href='https://twitter.com/boskoivanisevic' class='social-link-item' target='_blank'>
<i class='fab fa-twitter'></i>
</a></li>
<li><a href='https://linkedin.com/in/boskoivanisevic' class='social-link-item' target='_blank'>
<i class='fab fa-linkedin'></i>
</a></li>
<li><a href='https://github.com/bosko' class='social-link-item' target='_blank'>
<i class='fab fa-github'></i>
</a></li>
<li><a href='https://stackoverflow.com/users/1665470/boško-ivanišević' class='social-link-item' target='_blank'>
<i class='fab fa-stack-overflow'></i>
</a></li>
<li><a href='https://dev.to/bosko' class='social-link-item' target='_blank'>
  <i class='fab fa-dev' title='bosko's DEV Profile'></i>
</a></li>
</ul>
</div>
</div>
</div>
</div>
<main id="content" class="content">
<header>
<h1 class="title">Using Selenium with Cucumber through Webrat or Capybara. Which one to choose?</h1>
<p class="subtitle" role="doc-subtitle">2010-10-31</p>
</header>
<div id="outline-container-org3c8e96b" class="outline-2">
<h2 id="org3c8e96b">Introduction</h2>
<div class="outline-text-2" id="text-org3c8e96b">
<p>
Testing is (or should be) important part of every software
development. Over time various testing strategies and supporting tools
and frameworks have been developed. Regarding Web development biggest
advance has been made in Behavior Driven Development. Consequently
many tools for BDD are published and used.
</p>

<p>
<a href="http://www.rubyonrails.org">Ruby on Rails</a> framework had great built-in support for testing from
the very beginning. As it usually happens, lot of specialised testing
tools appeared aside of it and among all of them my favourites are
<a href="http://rspec.info">RSpec</a> and <a href="http://github.com/aslakhellesoy/cucumber/wiki">Cucumber</a>. The first one for unit and the second for
functional tests. Both of them are well integrated with Ruby on Rails
and are very easy to set up and start with. Moreover there is no need
to use real browsers which results in fast tests execution. Perfect
way for BDD.
</p>

<p>
But what if you have to perform functional tests on non Ruby on Rails
applications or your application relies heavily on JavaScript (no
matter in which framework it is written)? Luckily Cucumber can be used
in that case too. Since Cucumber supports Rails out of the box there
is basically no need for some special configuration. On the other hand
if a real browser must be used in tests, or functional testing must be
done outside of the Rails environment setting up Cucumber can be
little tricky but still simple enough. In this article I will focus on
this scenario - _testing non Rails applications with <a href="http://github.com/aslakhellesoy/cucumber/wiki">Cucumber</a> and
<a href="http://seleniumhq.org">Selenium</a>.
</p>

<p>
Using Selenium in Cucumber tests is done through <a href="http://github.com/brynary/webrat/wiki">Webrat</a> or
<a href="http://github.com/jnicklas/capybara">Capybara</a>. First we must set up complete environment, and in the first
step all necessary gems must be installed:
</p>

<div class="org-src-container">
<pre class="src src-ruby">gem install launchy
gem install rspec
gem install cucumber
gem install webrat
gem install capybara --pre
gem install selenium-client
gem install selenium-webdriver
</pre>
</div>


<p>
<span class="underline">Option —pre is used to install Capybara 0.4.0 rc</span>
</p>
</div>
</div>

<div id="outline-container-org675f53f" class="outline-2">
<h2 id="org675f53f">Important notice for MS Windows users: Webrat depends on Json gem which installs binaries compiled against [Rubyinstaller](<a href="http://www.rubyinstaller.org">http://www.rubyinstaller.org</a>) Ruby 1.8.x version. If you are using 1.9.2 Ruby you must uninstall Json gem and install it again but with `&#x2013;platform=ruby` option:**</h2>
<div class="outline-text-2" id="text-org675f53f">
<div class="org-src-container">
<pre class="src src-ruby">gem uninstall json
gem install json --platform=ruby
</pre>
</div>
</div>
</div>

<div id="outline-container-orga96eb4c" class="outline-2">
<h2 id="orga96eb4c">Introduction</h2>
<div class="outline-text-2" id="text-orga96eb4c">
<p>
Since article focuses on the functional testing outside of Rails we
should manually create folder structure that Cucumber expects.
</p>

<p>
tests
</p>
<table>


</table>

<p>
All <code>.feature</code> files go in the <code>features</code> folder. In the <code>support</code>
folder <code>env.rb</code> file should be created and within it all set up must
be made. Finally steps are implemented in Ruby files in
<code>step_definitions</code> folder.
</p>
</div>
</div>

<div id="outline-container-org7ea2355" class="outline-2">
<h2 id="org7ea2355">Webrat</h2>
<div class="outline-text-2" id="text-org7ea2355">
<p>
<a href="http://github.com/brynary/webrat/wiki">Webrat</a> controls Selenium through Selenium RC (remote control) and
selenium-client gem. In order to use Selenium through Webrat put
following code in your <code>env.rb</code>:
</p>

<div class="org-src-container">
<pre class="src src-ruby">require 'cucumber/formatter/unicode'

require 'webrat'
require 'webrat/core/matchers'

Webrat.configure do |config|
  config.mode = :selenium
  config.application_framework = :external
  config.selenium_server_address = '127.0.0.1'
    if RbConfig::CONFIG['host_os'] =~ /mingw|mswin/
  config.selenium_browser_startup_timeout = 60
  config.application_address = 'localhost'
  config.application_port = '3000'
end

World do
  session = Webrat::Session.new
  session.extend(Webrat::Methods)
  session.extend(Webrat::Selenium::Methods)
  session.extend(Webrat::Selenium::Matchers)
  session
end
</pre>
</div>

<p>
That’s all if you are running Linux based system. On Windows a little
bit more effort must be made. First of all, Webrat usess 0.0.0.0 IP
address when it starts Selenium and MS Windows does not like it at
all. Secondly it uses `/dev/null` stream which is not available on MS
Windows. Patch is already submitted and you can follow a ticket at
<a href="https://webrat.lighthouseapp.com/projects/10503/tickets/387-tiny-patch-for-work-with-selenium-on-windows#ticket-387-2">Webrat Lighthouse</a>. But until fix is accepted and new version is
released, you can take a patch from <a href="http://gist.github.com/584005">Github gist</a> and apply it to
Webrat sources.
</p>

<p>
Besides this patch few more things must be done. Line:
</p>

<div class="org-src-container">
<pre class="src src-ruby">config.selenium_server_address = '127.0.0.1' if RbConfig::CONFIG['host_os'] =~ /mingw|mswin/
</pre>
</div>

<p>
must be added to the <code>config</code> block as is already shown in the above
snippet. Unfortunately selenium-client gem does not recognize
<a href="http://www.rubyinstaller.org">Rubyinstaller</a> since it is built using MinGW tools. Therefore one more
tiny patch must be made in the
<code>selenium-client-1.2.18/lib/nautilus/shell.rb</code> file. Function
<code>windows?</code> must be replaced with:
</p>

<div class="org-src-container">
<pre class="src src-ruby">def windows?
  ::RbConfig::CONFIG['host_os'] =~ /mswin|mingw/
end
</pre>
</div>

<p>
You are ready for application testing. By default Selenium will use
Firefox and if you want to use other browser (in the example Internet
Explorer is set) add following line to `config` block:
</p>

<div class="org-src-container">
<pre class="src src-ruby">config.selenium_browser_key = '*iexplore'
</pre>
</div>
</div>
</div>

<div id="outline-container-org02692b5" class="outline-2">
<h2 id="org02692b5">Capybara</h2>
<div class="outline-text-2" id="text-org02692b5">
<p>
Although <a href="http://github.com/jnicklas/capybara">Capybara</a> can use Selenium RC, it primarily uses Selenium
WebDriver which is still in beta phase but is working good. Since we
already installed all necessary gems we can go on with configuring our
testing environment. File `env.rb` should look like this:
</p>

<div class="org-src-container">
<pre class="src src-ruby">require 'rbconfig'
require 'cucumber/formatter/unicode'

require 'capybara'
require 'capybara/dsl'
require "capybara/cucumber"

Capybara.default_driver = :selenium
Capybara.app_host = "http://127.0.0.1:8000/"
Capybara.register_driver :selenium do |app|
  Capybara::Driver::Selenium.new(app, :browser =&gt; :firefox)
end

World(Capybara)
</pre>
</div>

<p>
Setting up Capybara is definitely much easier. But on MS Windows
systems, if you want to use Internet Explorer, you still have to patch
sources. Authors are already <a href="http://groups.google.com/group/webdriver/browse_thread/thread/a8ed4ce6f98e8322">notified about required patch</a> and I
believe that new version of <code>selenium-webdriver</code> gem will be released
with it. In the meantime you just have to change definition of
<code>initialize</code> method in
<code>selenium-webdriver-0.0.28/lib/selenium/webdriver/ie/bridge.rb</code> from:
</p>

<div class="org-src-container">
<pre class="src src-ruby">def initialize()
</pre>
</div>

<p>
to
</p>

<div class="org-src-container">
<pre class="src src-ruby">def initialize(opts = {})
</pre>
</div>

<p>
Changing browser is as easy as changing <code>:firefox</code> to <code>:ie</code> or
<code>:chrome</code>. Instead of <code>:firefox</code> you can also use <code>:ff</code> and for
Internet Explorer <code>:internet_explorer</code>. One more notice about
differences if you are switching from Webrat to Capybara. Capybara
will reset session after each step. If you do not want that (for
example you log in to your application in the first scenario, and do
not want to repeat it in each succeeding one) just add:
</p>

<div class="org-src-container">
<pre class="src src-ruby">After do
end
</pre>
</div>

<p>
in <code>env.rb</code> file.
</p>

<p>
With Capybara you are not limited to Selenium WebDriver. If you want
to use Selenium RC you just need to configure it in <code>env.rb</code> file:
</p>

<div class="org-src-container">
<pre class="src src-ruby">require 'rbconfig'
require 'cucumber/formatter/unicode'

require 'capybara'
require 'capybara/dsl'
require "capybara/cucumber"

Capybara.default_driver = :selenium
Capybara.app_host = "http://127.0.0.1:9000/"
Capybara.register_driver :selenium do |app|
  # This way we are using Selenium-RC
  Capybara::Driver::Selenium.new(app,
                                 :browser =&gt; :remote,
                                 :url =&gt; "http://127.0.0.1:4444/wd/hub",
                                 :desired_capabilities =&gt; :internet_explorer)
end

World(Capybara)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgecc088b" class="outline-2">
<h2 id="orgecc088b">Conclusion</h2>
<div class="outline-text-2" id="text-orgecc088b">
<p>
Both gems for running Selenium as a base for functional tests - Webrat
and Capybara are easy to use. Although Webrat needs more patching to
work under Windows it has one advantage. It can be used with <a href="http://mechanize.rubyforge.org/mechanize/">Mechanize</a>
if you do not need real browser and you still want to test non Rails
application. But as much as it is advantage for “classic” Web
application Mechanize cannot interpret JavaScript. So if you want to
include JavaScript testing you either have to use real browser or
switch to Capybara.
</p>

<p>
Capybara, on the other hand, needs significantly less patching on MS
Windows systems and it cannot use Mechanize as far as I know. But,
from my point of view, it is easier to use then Webrat. Currently it
cannot use Mechanize, but it can use <a href="http://github.com/langalex/culerity/">Culerity</a> and <a href="http://celerity.rubyforge.org/">Celerity</a> for
JavaScript testing. Moreover <a href="http://github.com/smparkes/capybara-envjs">capybara-envjs driver</a> can be used to
interpret JavaScript outside of the browser.
</p>

<p>
Although I’m still not sure which one is better to use, I switched
from Webrat to Capybara and I think that tests that use Selenium
WebDriver are running faster. There is an <a href="http://groups.google.com/group/ruby-capybara/browse_thread/thread/4bcc26a9cfa20ef2">initiative for merging</a> these
projects into one but I do not know if it will happen and when. I
would like to hear what you think. What is your choice: Webrat or
Capybara?
</p>
</div>
</div>
</main>
</body>
</html>